//
//  grajdanstvo.swift
//  GeoriaHelper
//
//  Created by Дмитрий Гусев on 06.02.2023.
//

import Foundation

var grajdanstvo = [Place]()

func grajdanstvoPrepare() {
    
}

var grajdanstvoGeo = Place(name: "Гражданство", description: """
Сегодня есть несколько способов получить гражданство Грузии 👇

1) Натурализация
Это юридический процесс приобретения гражданства на основе добровольного желания соискателя. Иными словами, это стандартная процедура для иностранного гражданина, прописанная в законе принимающей стороны.

Для того чтобы пройти натурализацию в Грузии, нужно соблюсти следующие условия:

▪ легально проживать на территории страны в течение десяти лет. Для этого необходимо после года пребывания в Грузии податься на постоянный или временный вид на жительство;
▪ иметь постоянное место жительства, в собственности или арендованное. В арендованном жилье вы должны быть официально зарегистрированы, это важно;
▪ сдать экзамены на знание грузинского языка, основ права и истории страны;
▪ ваш минимальный месячный доход должен составлять минимум 400 лари;
▪ работать или стать владельцем бизнеса, это доступно для всех, кто имеет вид на жительство в Грузии.

❓ Вопросами натурализации в Грузии занимается Дом Юстиции nbe.gov.ge (nbe.gov.ge), именно туда соискателю необходимо отправить заявление и следующие документы:

▪ заявление, заполненное по утвержденному образцу на грузинском языке;
▪ документ, удостоверяющий личность;
▪ свидетельство о рождении;
▪ справка о доходах;
▪ подтверждение проживания в Грузии в течение 10 лет.

2) Брак с гражданином (гражданкой) Грузии
Еще одна возможность получить гражданство – заключить брак с гражданином Грузии. Раньше было достаточно двух лет проживания в законных отношениях, теперь срок увеличился до пяти лет. Также обязательна сдача языкового экзамена.

Документы, которые необходимо для подачи заявления на гражданство 👇
▪ заявление, заполненное на грузинском языке;
▪ свидетельство о браке;
▪ свидетельство о рождении;
▪ грузинский паспорт супруга/супруги.
▪ Плюс к этому у вас могут потребовать доказательства того, что ваш брак не фиктивный, например, совместные фото и выписки с банковского счета.

3) Исключительный порядок предоставления гражданства
▪ в случае, если вы внесли значительный вклад в экономику Грузии, путем вложения инвестиций (примерно 300 000 долларов);
▪ если вы имеете значительные успехи в науке, искусстве или спорте и готовы вести эту деятельность от имени Грузии;
▪ если вы эмигрировали из страны по политическим или экономическим соображениям;
▪ если вы проживаете на оккупированной территории Грузии.
""", url: "http://nbe.gov.ge/index.php?sec_id=1&lang_id=RUS")

