//
//  vnz.swift
//  GeoriaHelper
//
//  Created by Дмитрий Гусев on 06.02.2023.
//

import Foundation

var vnz = [Place]()

func vnzPrepare() {
    
}


var vidNaZitelstvo = Place(name: "Вид на жительство", description: """
Способы получения ВНЖ 👇

▪ супруги, несовершеннолетние дети и родители несовершеннолетних детей – граждан Грузии
▪ учащиеся в местных университетах, ПТУ, школах
▪ несовершеннолетние дети и супруги владельца краткосрочного ВНЖ (очень частая схема, когда родители ребенка, который получил ВНЖ по учебе в школе, подаются на ВНЖ)
▪ купившие недвижимость на сумму в 100 тысяч$ (до 2019 года — 50 тыс.$)
▪ трудоустроенные в компании, имеющей оборот от 50000 лари в год на каждого иностранного специалиста  (в том числе, через ИП, после того, как его доход превысит 50 тысяч лари)

➕Преимущества ВНЖ

▪ возможность открытия мультивалютного счета в любом банке
▪ разрешает проживать в стране в течение срока его действия, то есть не нужно выезжать через год
▪ обращаться в консульские учреждения иностранных государств (подавать документы на шенген, без ВНЖ не принимают)
▪ получить медицинскую страховку, на более льготных условиях (например, оплачивать ее ежемесячно, а не единовременно за год)
▪ в медицинских учреждениях есть скидки для резидентов
▪ выдать доверенность дистанционно, по видеозвонку с нотариусом
▪ воспользоваться электронными государственными сервисами, а некоторыми со скидкой
▪ сделать вакцину от covid-19 без ожидания
▪ возможность выехать на авто с грузинскими номерами некоторые страны
▪ получить скидку до 50% в музеи, парки и природоохранные территории
▪ подать через 10 лет ВНЖ, документы на получение гражданства Грузии

❗️ Что происходит сейчас по факту: каждая вторая поданная заявка, даже с полным комплектом документов на ВНЖ в Дом Юстиции, отклоняется. Отказ мотивируется статьёй 'иные причины' и не требует объяснения от властей Грузии.

🖇 Виды ВНЖ (по ссылке): Виды ВНЖ
""", url: "https://justadvisors.ge/individuals/poluchenie-vnzh-v-gruzii/")
