//
//  operatori.swift
//  GeoriaHelper
//
//  Created by Дмитрий Гусев on 05.02.2023.
//

import Foundation

var operatori = [Place]()

func operatoriPrepare() {
    
}

var magti = Place(name: "Magti", description: "Это первый мобильный оператор на территории грузии с самой широкой зоной покрытия. Лидер по качеству 4G/LTE. Подходит активным туристам, покорителям гор и глубинок или тем, кому нужен мобильный интернет для работы. Magti позволит вам оставаться на связи даже в самых отдаленных уголках.Приобрести симку можно как в крупных городах, так и в аэропортах Тбилиси и Кутаиси. Сайт компании поддерживает три языка - грузнский, английский и русский.", url: "https://www.magticom.ge/ru/home")

var beeline = Place(name: "Beeline", description: "Симкарта Beeline в Грузии пользуется спросом из-за цены. Подойдёт тем, кто собирается находиться в городах и если не съезжать с основных маршрутов, то связь нормальная, как и интернет. Особенно, если поддерживается 4G. Есть специальный пакет «Турист». Сайт компании поддерживает языковую платформу на грузинском, английском и русском языках, а потому вся информация будет любому.", url: "https://beeline.ge/ru")

var geocell = Place(name: "Geocell", description: "Самый распространённый мобильный оператор в Грузии в данное время. Имея хорошую зону покрытия, сочетает цену/качество. Популярен среди местного городского населения. Точки продаж есть во всех крупных городах и аэропортах, в гостиницах, хостелах, в метро и тд. В Батуми можно приобрести симку даже на пляже. У этого оператора есть специальный туристический пакет «All inclusive» (Все включено)")
